adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21G17L.atdf
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMD21G1xL" caption="SAMD21G1xL">
      <pin position="1" pad="PA02"/>
      <pin position="2" pad="PA03"/>
      <pin position="3" pad="PB04"/>
      <pin position="4" pad="PB05"/>
      <pin position="5" pad="GNDANA"/>
      <pin position="6" pad="VDDANA"/>
      <pin position="7" pad="PB08"/>
      <pin position="8" pad="PB09"/>
      <pin position="9" pad="PA04"/>
      <pin position="10" pad="PA05"/>
      <pin position="11" pad="PA06"/>
      <pin position="12" pad="PA07"/>
      <pin position="13" pad="PA08"/>
      <pin position="14" pad="PA09"/>
      <pin position="15" pad="PA10"/>
      <pin position="16" pad="PA11"/>
      <pin position="17" pad="VDDIO"/>
      <pin position="18" pad="GNDIO"/>
      <pin position="19" pad="PB10"/>
      <pin position="20" pad="PB11"/>
      <pin position="21" pad="PA12"/>
      <pin position="22" pad="PA13"/>
      <pin position="23" pad="PA14"/>
      <pin position="24" pad="PA15"/>
      <pin position="25" pad="PA16"/>
      <pin position="26" pad="PA17"/>
      <pin position="27" pad="PA18"/>
      <pin position="28" pad="PA19"/>
      <pin position="29" pad="PA20"/>
      <pin position="30" pad="PA21"/>
      <pin position="31" pad="PA22"/>
      <pin position="32" pad="PA23"/>
      <pin position="33" pad="PA24"/>
      <pin position="34" pad="PA25"/>
      <pin position="35" pad="GNDIO"/>
      <pin position="36" pad="VDDIO"/>
      <pin position="37" pad="PA27"/>
      <pin position="38" pad="RESET_N"/>
      <pin position="39" pad="PA28"/>
      <pin position="40" pad="GNDIO"/>
      <pin position="41" pad="VDDCORE"/>
      <pin position="42" pad="VDDIN"/>
      <pin position="43" pad="PA30"/>
      <pin position="44" pad="PA31"/>
      <pin position="45" pad="PB00"/>
      <pin position="46" pad="PB01"/>
      <pin position="47" pad="PB02"/>
      <pin position="48" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>